GT1/GT1/turbulent_planar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(

);

application     foamRun;

solver          incompressibleFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;	//20000

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     binary;	//ascii;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

cacheTemporaryObjects
(
    "kOmega:G"
    "(beta*omega)"
    "nuEff"
    "(nut+nu)"
);

// ************************************************************************* //

functions
{

///////////////////////////////////////////////////////////////////////////

minmaxdomain_scalar
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");

    enabled 	    true; 	//true or false
    log             true;	//write to screen
    
    //writeControl    writeTime;
    writeControl    timeStep;
    writeInterval   1;

    writeFields     false;	//write solution to field value - Not needed when only reporting value to screen

    writeLocation   true;	//write location in the output file

    //mode component;

    select      all;

    operation       none;

    fields
    (
        p
	k 
	omega 
	nut 
	epsilon 
	nuTilda
    );
}

minmaxdomain_vector
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");

    enabled 	    true; 	//true or false
    log             true;	//write to screen
    
    //writeControl    writeTime;
    writeControl    timeStep;
    writeInterval   1;

    writeFields     false;	//write solution to field value - Not needed when only reporting value to screen

    writeLocation   true;	//write location in the output file

    //mode component;

    select      all;

    operation       none;

    fields
    (
        U
    );
}

mindomain_scalar
{
    $minmaxdomain_scalar
    operation       min;
}

mindomain_vector
{
    $minmaxdomain_vector
    operation       minMag;
}

maxdomain_scalar
{
    $minmaxdomain_scalar
    operation       max;
}

maxdomain_vector
{
    $minmaxdomain_vector
    operation       maxMag;
}

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
//Saves yplus field at the given interval

    yplus_field
    {
        type yPlus;
        libs ("libutilityFunctionObjects.so");

        enabled true;
        //log false;

        writeControl outputTime;
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
//Print y+ stats every iteration without saving the field

    yplus_stats
    {
        type yPlus;
        libs ("libutilityFunctionObjects.so");

        enabled true;

        writeControl timeStep;
        writeInterval 1;

//Leave object empty to not save the field
//This will only print the yplus values every timestep and will not save the field
        objects ();
        log true;
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

wallShearStress1
{
    type                wallShearStress;
    functionObjectLibs  ("libutilityFunctionObjects.so");

    enabled true;

    writeControl outputTime;
    //writeControl timeStep;
    //writeInterval 1;

    //log true;
}

///////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////

writeObjects1
{
    type        writeObjects;
    libs        ("libutilityFunctionObjects.so");

    enabled           on;

    //writeControl     outputTime;

    //writeControl     timeStep;
   // writeInterval    1;

    writeControl     outputTime;
    //writeInterval    $endTime;

//Switch-off to save complex cacheTemporaryObjects names
    regExp  off;

    objects     
    (    
    "kOmega:G"
    "(beta*omega)"
    "nuEff"
    "(nut+nu)"
    );
}

// #includeFunc writeObjects(regExp=off, "CDES*delta")

///////////////////////////////////////////////////////////////////////////

}

// ************************************************************************* //
